Revit 2027 API
FabricationConfiguration.GetFabricationConnectorGroup Method
 Gets the fabrication connector group from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetFabricationConnectorGroup(
	int fabricationConnectorId
)
Public Function GetFabricationConnectorGroup (
	fabricationConnectorId As Integer
) As String
public:
String^ GetFabricationConnectorGroup(
	int fabricationConnectorId
)
member GetFabricationConnectorGroup :
        fabricationConnectorId : int -> string
Parameters
fabricationConnectorId Int32
 The fabrication connector identifier.
Return Value
String
 The fabrication connector's group.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace